
package spbstu.mcs.telegramBot.service;

public class BotCommand {

    public static String handlerStart(){
        return "\uD83D\uDE80 Добро пожаловать в BitBotX — вашего надежного помощника в мире криптовалют!\n" +
                "С моей помощью вы сможете:\n" +
                "\uD83D\uDD39 Узнавать актуальные цены на BTC, ETH и другие криптовалюты.\n" +
                "\uD83D\uDD39 Анализировать историю цен за выбранный период.\n" +
                "\uD83D\uDD39 Сравнивать курсы разных активов.\n" +
                "\uD83D\uDD39 Управлять портфелем: добавлять криптовалюты, отслеживать прибыль и убытки.\n" +
                "\uD83D\uDD39 Настраивать оповещения о важных изменениях цен.\n" +
                "❓ Нужна помощь? Напишите /help, и я расскажу, как работать с моими функциями!\n" +
                "\uD83D\uDCC8 Давайте начнем! Просто выберите нужную команду или введите интересующий вас запрос.";
    }

    public static String handlerHelp(){
        return "\uD83D\uDCDA BitBotX Help Center\n" +
                "Ваш гид по возможностям крипто-бота\n" +
                "\uD83D\uDD39 Основные команды:\n" +
                "▸ /start - Начало работы с ботом\n" +
                "▸ /help - Это справочное меню\n" +
                "▸ /authors - список авторов\n" +
                "▸ /set_fiat <валюта> - Насктройка фиатной валюты по умолчанию\n" +
                "▸ /set_crypto <криптовалюта> - Настройка криптовалюты по умолчанию\n" +
                "\uD83D\uDCCA Мониторинг цен:\n" +
                "▸ /show_current_price - Текущий курс валюты по умолчанию\n" +
                "▸ /show_price_history <период >- История цены (3d/7d/1M)\n" +
                "▸ //compare_сurrency <валюта 1> <валюта 2> <период> - Сравнение криптовалют ( 3h/12h/24h - часы, 3d/7d/30d - дни)\n" +
                "\uD83D\uDCBC Портфель:\n" +
                "▸ /add <количество> <валюта> - Добавить актив\n" +
                "▸ /portfolio - Просмотр портфеля\n" +
                "\n" +
                "\n" +
                "\uD83D\uDD14 Оповещения:\n" +
                "▸ /set_alert_EMA  <валюта> - По индикатору\n" +
                "▸ /set_alert_VAL  <валюта> <валюта> <максимальная цена>  <минимальная цена> - По цене\n" +
                "▸ /set_alert_PERC  <валюта> <максимальный прирост к изначальному значению в процентах> \n" +
                "<максимальный убыток от начального значения в процентах> - По процентам\n" +
                "▸ /my_alerts - Активные оповещения\n" +
                "▸ /delete_alert_ <тип оповещения>  <валюта> - Удалить оповещение\n" +
                "▸ /delete_all_alerts  - Удаление всех оповещений\n";
    }


    public static String handlerQ() {
        return "Неизвестная команда. Для просмотра списка команд, используйте команду /help.";
    }
}
